# -----------------------------------------------------------------------------
# ~/.config/brew/Brewfile
# -----------------------------------------------------------------------------

tap 'homebrew/bundle' # needs to be installed before this can run, though...

tap 'homebrew/dupes'
tap 'homebrew/versions'

# command_not_found_handle() assistant
tap 'homebrew/command-not-found'

# -----------------------------------------------------------------------------
# essentials
# -----------------------------------------------------------------------------

# for Homebrew
brew 'curl'
brew 'openssl'
brew 'git', args: ['with-brewed-curl', 'with-brewed-openssl']

# bash 4
brew 'bash'
brew 'homebrew/versions/bash-completion2'

# tmux
brew 'tmux'
brew 'reattach-to-user-namespace'

# other
brew 'direnv', args: ['force-bottle']
brew 'fpp'
brew 'midnight-commander'
brew 'vim', args: ['HEAD', 'override-system-vi']
brew 'homebrew/dupes/less', args: ['with-pcre']
brew 'homebrew/dupes/ncurses'

# -----------------------------------------------------------------------------
# GNU utilities
# -----------------------------------------------------------------------------

brew 'coreutils', args: ['HEAD']
brew 'moreutils', args: ['HEAD']
brew 'gawk'
brew 'gnu-tar'

# find, locate, updatedb, and xargs (do not prepend 'g' to the binaries)
brew 'findutils', args: ['default-names']

# sed (overwrite built-in)
brew 'gnu-sed', args: ['default-names']

# grep (overwrite built-in)
brew 'homebrew/dupes/grep', args: ['with-default-names']

# -----------------------------------------------------------------------------
# internet stuff
# -----------------------------------------------------------------------------

brew 'links'
brew 'ngrep'
brew 'transmission'
brew 'wget', args: ['HEAD', 'enable-iri', 'with-pcre']
brew 'youtube-dl', args: ['HEAD', 'with-rtmpdump']
brew 'homebrew/dupes/rsync'
brew 'homebrew/dupes/whois'

# OpenSSH

brew 'ssh-copy-id'
brew 'homebrew/dupes/openssh'
brew 'keychain'

# email

brew 'getmail'
# brew 'mu'
brew 'offline-imap'

# -----------------------------------------------------------------------------
# media
# -----------------------------------------------------------------------------

# audio/video

brew 'atomicparsley'
brew 'ffmpeg', args: ['with-openssl', 'with-rtmpdump']
brew 'id3v2'
brew 'lame'
brew 'mp4v2'
brew 'mplayer'

# images

brew 'exif'
brew 'exiftool'
brew 'imagemagick', args: ['with-ghostscript']
brew 'pngcrush'
brew 'qrencode'
brew 'webkit2png'

# imagesnap requires full Xcode to compile
brew 'imagesnap' if system '[[ -x /Applications/Xcode.app ]]'

# -----------------------------------------------------------------------------
# development
# -----------------------------------------------------------------------------

brew 'rbenv'
brew 'ruby-build'

brew 'python'

brew 'jq'
brew 'node'

brew 'go'

# https://github.com/zoltan-dulac/css3FontConverter
brew 'fontforge'
tap 'bramstein/webfonttools'
brew 'sfnt2woff-zopfli'
brew 'sfnt2woff'
brew 'sfntly'
brew 'ttf2eot'
brew 'woff2'

# -----------------------------------------------------------------------------
# fun & games
# -----------------------------------------------------------------------------

tap  'homebrew/games'
brew 'homebrew/games/nethack'

brew 'cowsay'
brew 'figlet'

# -----------------------------------------------------------------------------
# misc.
# -----------------------------------------------------------------------------

brew 'jrnl'

brew 'pv'
brew 'rename'
brew 'sf-pwgen' # github.com/anders/pwgen
brew 'source-highlight' # for less
brew 'tree'
brew 'watch'

# archives & compression
brew 'dtrx', args: ['with-cabextract', 'with-lha', 'with-unshield']
brew 'p7zip'
brew 'unrar'

# dictionaries
brew 'dict'
brew 'sdcv'

# GnuPG & friends
# brew 'gnupg2', args: ['with-readline']
# brew 'gpg-agent'
brew 'pinentry'
brew 'keybase'

# pdf
brew 'ghostscript'

# shells
# brew 'fish'
# brew 'zsh'

# text
brew 'aspell', args: ['with-lang-en']
brew 'dos2unix'
brew 'multimarkdown'
brew 'pandoc'
brew 'recode'
brew 'txt2man'
