# -----------------------------------------------------------------------------
# ~/.config/brew/Brewfile
# vim:ft=ruby
# -----------------------------------------------------------------------------
# brew bundle --file=$XDG_CONFIG_HOME/brew/Brewfile
# -----------------------------------------------------------------------------

tap  "homebrew/bundle"
tap  "homebrew/command-not-found"
tap  "homebrew/services"
tap  "zgracem/caveats"

# -----------------------------------------------------------------------------
# essentials
# -----------------------------------------------------------------------------

# for Linuxbrew
brew "gcc" if OS.linux?

# for Homebrew
brew "curl"
brew "git"

# shells
brew "bash"
brew "fish"

# tmux
brew "tmux"
brew "reattach-to-user-namespace" if OS.mac?

# other
brew "dtrx"
brew "fd"
brew "jq"
brew "keychain"
brew "less"
brew "stow"
brew "the_silver_searcher"
brew "vim"
brew "wget"

if OS.mac?
  brew "rename"
  brew "rsync"

  # GNU utilities
  brew "binutils"
  brew "coreutils"
  brew "diffutils"
  brew "findutils"
  brew "inetutils"
  brew "gawk"
  brew "gnu-sed"
  brew "gnu-tar"
  brew "grep"
end

# -----------------------------------------------------------------------------
# more
# -----------------------------------------------------------------------------

brew "bat"
brew "exa"
brew "hexyl"
brew "htop"
brew "parallel"
brew "source-highlight" # for less
brew "sponge"

if OS.mac?
  brew "sf-pwgen"
  brew "tree"
  brew "unar"
  brew "watch"
end

# internet stuff
brew "dnsmasq", restart_service: :changed if OS.mac?
brew "links"
brew "lynx"
brew "openssh"
brew "ssh-copy-id", link: true
brew "transmission-cli"
brew "youtube-dl"
brew "yt-dlp"

# documents
brew "dos2unix"
brew "ghostscript"
brew "multimarkdown"
brew "pandoc"
brew "qpdf"
brew "recode"

# fun, games
brew "cowsay"
brew "fortune"
brew "figlet"
brew "lolcat"
brew "nethack"
brew "openjdk" # java(1) for Minecraft mods
brew "ponysay"
brew "screenfetch"

# -----------------------------------------------------------------------------
# audio/video
# -----------------------------------------------------------------------------

brew "atomicparsley"
brew "id3v2"
brew "mkvtoolnix"
brew "mp4v2"

# ffmpeg with options
tap  "homebrew-ffmpeg/ffmpeg"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: %w[
  HEAD
  with-fdk-aac
  with-libssh
  with-openh264
  with-openssl
  with-rtmpdump
  with-two-lame
  with-webp
  with-xvid
]

# images
brew "exif"
brew "exiftool"
brew "imagemagick"
brew "pngcrush"
brew "webp"

if OS.mac?
  brew "imagesnap"
  brew "webkit2png"
end

# -----------------------------------------------------------------------------
# development stuff
# -----------------------------------------------------------------------------

if OS.mac?
  brew "autoconf"
  brew "cmake"
  brew "glib"
  brew "gmp"
  brew "gsl"
  brew "llvm"
  brew "texinfo"
end

brew "hub"
brew "ncurses"
brew "shellcheck"
brew "taglib" # for taglib-ruby gem

# documentation
brew "groff"
brew "help2man"
brew "alhadis/troff/man-db" if OS.mac?

# JavaScript
brew "coffeescript"
brew "node"
brew "typescript"
brew "yarn"

# ruby
brew "rbenv"
brew "rbenv-default-gems"
brew "ruby-build"
brew "rbenv-bundler"

# Dart Sass
tap  "sass/sass"
brew "sass/sass/sass"

# web fonts
brew "fontforge"
tap  "bramstein/webfonttools"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/woff2"
