# -----------------------------------------------------------------------------
# Erato:~/.local/config/Brewfile
# -----------------------------------------------------------------------------

# Instructions:
#   1. Install Homebrew
#   2. `brew tap homebrew/bundle`
#   3. `brew bundle --file=~/.config/brew/Brewfile`
#   4. `brew bundle --file=$THIS_FILE`

# -----------------------------------------------------------------------------
# internet stuff
# -----------------------------------------------------------------------------

brew "youtube-dl", args: ["HEAD", "with-rtmpdump"]

# -----------------------------------------------------------------------------
# media
# -----------------------------------------------------------------------------

# audio/video

brew "ffmpeg", args: ["with-openssl", "with-rtmpdump"]
brew "mplayer"

# images

brew "exif"
brew "exiftool"
brew "imagemagick", args: ["with-ghostscript"]
brew "qrencode"
brew "webkit2png"

# -----------------------------------------------------------------------------
# fun & games
# -----------------------------------------------------------------------------

tap  "homebrew/games"
brew "homebrew/games/nethack"

# -----------------------------------------------------------------------------
# misc.
# -----------------------------------------------------------------------------

brew "agedu"
brew "keychain"
brew "midnight-commander"
brew "sf-pwgen" # github.com/anders/pwgen

# dictionaries
brew "dict"
brew "sdcv"

# pdf
brew "ghostscript"

# -----------------------------------------------------------------------------
# casks
# -----------------------------------------------------------------------------

# essentials

cask "1password"
cask "alfred"
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "slack"
#cask "sublime-text"
cask "the-unarchiver"
cask "transmission"
cask "transmit"

# utilities

cask "dayone-cli"
cask "flux"
cask "go2shell"
cask "grandperspective"
cask "istat-menus"

# audio/video

cask "fission"
cask "kid3"
cask "vlc"
cask "xact"

# etc.

cask "onyx"
cask "skype"
cask "steam"
cask "xscreensaver"

# QuickLook

cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "suspicious-package"

# -----------------------------------------------------------------------------
# Mac App Store
# -----------------------------------------------------------------------------

brew "mas"

mas "Day One", id: 1055511498
mas "Divvy", id: 413857545
mas "Persistent Color Picker", id: 442921390
mas "Sip", id: 507257563
mas "The Archive Browser", id: 510232205
#mas "Xcode", id: 497799835
