# -----------------------------------------------------------------------------
# Athena:~/.local/config/Brewfile
# -----------------------------------------------------------------------------

# Instructions:
#   1. Install Homebrew
#   2. `brew tap homebrew/bundle`
#   3. `brew bundle --file=~/.config/brew/Brewfile`
#   4. `brew bundle --file=$THIS_FILE`

# -----------------------------------------------------------------------------
# internet stuff
# -----------------------------------------------------------------------------

brew "dnsmasq"
brew "transmission"
### Install w/ pip to get the youtube_dl Python module too.
# brew "youtube-dl"

# -----------------------------------------------------------------------------
# media
# -----------------------------------------------------------------------------

# audio/video

brew "atomicparsley"
brew "id3v2"
brew "lame"
brew "mkvtoolnix"
brew "mp4v2"
brew "mplayer"

# ffmpeg with options
tap  "varenc/ffmpeg"
brew "varenc/ffmpeg/ffmpeg", args: [
  "HEAD",
  "with-fdk-aac",
  "with-libssh",
  "with-openh264",
  "with-openssl",
  "with-rtmpdump",
  "with-two-lame",
  "with-webp",
  "with-xvid"
]

# images

brew "exif"
brew "exiftool"
brew "imagemagick@6"
brew "pngcrush"
brew "webkit2png"

# imagesnap requires full Xcode to compile (not just CLT)
brew "imagesnap" if system "[[ -x /Applications/Xcode.app ]]"

# -----------------------------------------------------------------------------
# development
# -----------------------------------------------------------------------------

brew "shellcheck"

# >> https://github.com/zoltan-dulac/css3FontConverter
brew "fontforge"

# >> https://github.com/bramstein/homebrew-webfonttools
tap  "bramstein/webfonttools"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/sfntly"
brew "bramstein/webfonttools/ttf2eot"
brew "bramstein/webfonttools/woff2"

# -----------------------------------------------------------------------------
# misc.
# -----------------------------------------------------------------------------

brew "agedu"
brew "sf-pwgen" # github.com/anders/pwgen
brew "unar"

# dictionaries
brew "dict"
brew "sdcv"

# shells
brew "zsh"
brew "zsh-syntax-highlighting"

# text
brew "pandoc"
brew "recode"
