# -----------------------------------------------------------------------------
# Athena:~/.local/config/brew/Brewfile
# vim:ft=ruby
# -----------------------------------------------------------------------------

# Instructions:
#   1. Install Homebrew
#   2. `brew tap homebrew/bundle`
#   3. `brew bundle --file=~/.config/brew/Brewfile`
#   4. `brew bundle --file=~/.local/config/brew/Brewfile` [this file]

tap "homebrew/command-not-found"
tap "homebrew/services"
tap "zachwick/license"

# -----------------------------------------------------------------------------
# internet stuff
# -----------------------------------------------------------------------------

brew "dnsmasq", restart_service: :changed
brew "transmission"
brew "youtube-dl" # install w/ pip to get the youtube_dl Python module too.

# -----------------------------------------------------------------------------
# media
# -----------------------------------------------------------------------------

# audio/video

brew "atomicparsley"
brew "id3v2"
brew "lame"
brew "mkvtoolnix"
brew "mp4v2"

# ffmpeg with options
tap  "homebrew-ffmpeg/ffmpeg"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: [
  "HEAD",
  "enable-videotoolbox",
  "with-fdk-aac",
  "with-libssh",
  "with-openh264",
  "with-openssl",
  "with-rtmpdump",
  "with-two-lame",
  "with-webp",
  "with-xvid"
]

# images

brew "exif"
brew "exiftool"
brew "imagemagick@6"
brew "imagesnap"
brew "pngcrush"
brew "webkit2png"

# -----------------------------------------------------------------------------
# development
# -----------------------------------------------------------------------------

brew "shellcheck"

# >> https://github.com/zoltan-dulac/css3FontConverter
brew "fontforge"

# >> https://github.com/bramstein/homebrew-webfonttools
tap  "bramstein/webfonttools"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/ttf2eot"
brew "bramstein/webfonttools/woff2"

# -----------------------------------------------------------------------------
# misc.
# -----------------------------------------------------------------------------

brew "agedu"
brew "sf-pwgen" # github.com/anders/pwgen
brew "unar"

# text
brew "pandoc"
brew "recode"

# -----------------------------------------------------------------------------
# additional casks
# -----------------------------------------------------------------------------

cask "bitbar"
cask "calibre"
cask "handbrake"
cask "istat-menus"
cask "keybase"
cask "kid3"
cask "metaz"
cask "mpv"
cask "onyx"
cask "senuti"
cask "steam"
cask "sublime-merge"
cask "xact"
