# ----------------------------------------------------------------------------
# brew bundle --file=$XDG_CONFIG_HOME/homebrew/Brewfile
# vim:ft=ruby
# ----------------------------------------------------------------------------

tap "homebrew/aliases"
tap "homebrew/command-not-found"
tap "nrlquaker/createzap" # `brew createzap` command

# GNU utilities
if OS.mac?
  brew "binutils"
  brew "coreutils"
  brew "diffutils"
  brew "findutils"
  brew "gawk"
  brew "gnu-sed"
  brew "gnu-tar"
  brew "grep"
  brew "inetutils"
  brew "m4"
end

# essential utilities
brew "bat"
brew "eza"
brew "fd"
brew "fish"
brew "jq"
brew "keychain" unless OS.mac?
brew "less"
brew "micro"
brew "openssh"
brew "openssl@3"
brew "p7zip"
brew "readline"
brew "rename" if OS.mac?
brew "ripgrep"
brew "rsync" if OS.mac?
brew "stow"
brew "tmux"
brew "pam-reattach" if OS.mac? # for tmux
brew "unar" if OS.mac?
brew "vim"

# more utilities
brew "bash"
brew "bchunk" # Convert CD images from .bin/.cue to .iso/.cdr
brew "bfs" # Breadth-first version of find
brew "btop"
brew "duti" if OS.mac?
brew "entr"
brew "hexyl"
brew "lsusb-laniksj" if OS.mac?
brew "ncurses"
brew "parallel"
brew "PotatoLabs/git-redate/git-redate"
brew "qrencode"
brew "sf-pwgen" if OS.mac?
brew "sponge"
brew "tree"
brew "tzdb" if OS.mac?

# text & documentation
brew "alhadis/troff/man-db" if OS.mac?
brew "dos2unix"
brew "ghostscript"
brew "groff"
brew "help2man"
brew "multimarkdown"
brew "pandoc"
brew "par"
brew "poppler"
brew "qpdf"
brew "recode"

# audio/video
brew "atomicparsley"
brew "id3v2"
brew "mkvtoolnix"
brew "mp3info"
brew "mp4v2"
brew "yt-dlp"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: %w[
  HEAD
  with-fdk-aac
  with-libssh
  with-openh264
  with-openssl
  with-rtmpdump
  with-two-lame
  with-webp
  with-xvid
]
cask "fission"
cask "handbrake"
cask "kid3"
cask "metaz"
cask "spotify"
cask "vlc"
cask "xact"

# images
brew "exif"
brew "exiftool"
brew "folderify" if OS.mac?
brew "imagemagick"
brew "imageoptim-cli"
brew "mozjpeg"
brew "imagesnap" if OS.mac?
brew "webkit2png" if OS.mac?
brew "webp"
cask "zgracem/formulae/acorn-latest7"
cask "imageoptim", args: { appdir: "/Applications" }
cask "retrobatch"

# internet stuff
tap "homebrew/services"
brew "alpine"
brew "aria2"
brew "bombadillo"
brew "curl"
brew "dnsmasq", restart_service: :changed if OS.mac?
brew "links"
brew "lynx"
brew "netcat"
brew "newsboat"
brew "ssh-copy-id", link: true
brew "streamlink"
brew "tnftpd"
brew "transmission-cli"
brew "wget"
cask "chatterino"
cask "discord"
cask "streamlink-twitch-gui"
cask "transmission"
cask "transmit"

# security
brew "gnupg"
brew "pinentry-mac" if OS.mac?
brew "ykman"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"

# ----------------------------------------------------------------------------
# development
# ----------------------------------------------------------------------------

brew "git"
brew "mercurial"
brew "subversion"

brew "gcc" if OS.linux? # for Linuxbrew

if OS.mac?
  brew "autoconf"
  brew "cmake"
  brew "glib"
  brew "llvm"
  brew "texinfo"
end

# ruby
brew "rbenv"
brew "rbenv-bundler"
brew "rbenv-default-gems"
brew "ruby-build"
brew "taglib" # for `taglib-ruby` gem

# JavaScript
brew "node"
brew "coffeescript"
brew "typescript"
brew "yarn"

# Python
brew "pyenv"

# VS Code extensions
brew "shellcheck"
brew "shfmt"

# (Dart) Sass
brew "sass/sass/sass"

# web fonts
brew "fontforge"
brew "bramstein/webfonttools/sfnt2woff-zopfli"
brew "bramstein/webfonttools/sfnt2woff"
brew "bramstein/webfonttools/woff2"

# Flipper Zero
brew "ufbt"

# virtual machines
brew "icoutils" # Extract resources from Windows binaries

# ----------------------------------------------------------------------------
# fun & games
# ----------------------------------------------------------------------------

brew "cowsay"
brew "dosbox-x"
brew "fastfetch"
brew "figlet"
brew "fortune"
brew "lolcat"
brew "nethack"
brew "toilet"
cask "inform"
cask "steam", args: { appdir: "/Applications" }
cask "twine"

# ----------------------------------------------------------------------------
# my stuff
# ----------------------------------------------------------------------------

tap "zgracem/commands", "~/Developer/Homebrew/homebrew-commands"
brew "zgracem/formulae/calendar"
brew "zgracem/formulae/zgm-calendar-data"
brew "zgracem/formulae/unrar"
cask "zgracem/formulae/lockscreen"

# ----------------------------------------------------------------------------
# casks
# ----------------------------------------------------------------------------

cask_args appdir: "~/Applications" # also set in HOMEBREW_CASK_OPTS

# essentials
cask "alfred"
cask "bettermouse"
cask "fantastical"
cask "firefox", args: { appdir: "/Applications" }
cask "go2shell"
cask "istat-menus", args: { appdir: "/Applications" }
cask "iterm2"
cask "maestral"
cask "name-mangler"
cask "obsidian"
cask "sublime-merge"
cask "superduper"
cask "swiftbar"
cask "the-unarchiver"
cask "visual-studio-code"
cask "xscreensaver"

# more
cask "appcleaner"
cask "disk-drill"
cask "file-juicer"
cask "grandperspective"
cask "mysides"
cask "pdf-expert"
cask "powershell"
cask "qflipper"
cask "raspberry-pi-imager"
cask "vnc-viewer"
cask "winclone"

# QuickLook
cask "qldds" # Deprecated!
cask "qlmarkdown"
cask "suspicious-package" # .pkg files
cask "syntax-highlight"

# ----------------------------------------------------------------------------
# Mac App Store
# ----------------------------------------------------------------------------

brew "mas"

# essentials
mas "ColorSlurp", id: 1287239339
mas "Divvy", id: 413857545
mas "Mactracker", id: 430255202
mas "Soulver 3", id: 1508732804
mas "The Archive Browser", id: 510232205
mas "Things", id: 904280696

# more
mas "1Blocker", id: 1365531024
mas "ApolloOne", id: 1044484672
mas "MacFamilyTree 10", id: 1567970985
mas "Prompt", id: 1594420480
mas "Steam Link", id: 1246969117
mas "Vinegar", id: 1591303229
mas "Wipr", id: 1320666476

# Apple stuff
mas "Apple Configurator", id: 1037126344
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
