# -----------------------------------------------------------------------------
# web500:~/.local/Brewfile
# -----------------------------------------------------------------------------

# Instructions:
#   1. Install Homebrew
#   2. `brew tap homebrew/bundle`
#   3. `brew bundle --file=$THIS_FILE`

tap "homebrew/dupes"
tap "homebrew/versions"

# -----------------------------------------------------------------------------
# essentials
# -----------------------------------------------------------------------------

# for Homebrew
brew "gcc"
brew "openssl"
brew "curl", args: ["with-nghttp2"]
brew "git", args: ["with-brewed-curl", "with-brewed-openssl"]

# bash 4
brew "bash", args: ["devel"]
brew "homebrew/versions/bash-completion2"

# tmux
brew "tmux"

# other
brew "dtrx", args: ["with-cabextract", "with-lha", "with-unshield"]
brew "fpp", args: ["HEAD"]
brew "vim", args: ["HEAD", "override-system-vi"]
brew "wget", args: ["HEAD", "enable-iri", "with-pcre"]
brew "homebrew/dupes/less", args: ["with-pcre"]
brew "homebrew/dupes/ncurses"

# images
brew "pngcrush"

# OpenSSH
brew "homebrew/dupes/openssh"
brew "ssh-copy-id"
brew "keychain"

# -----------------------------------------------------------------------------
# development
# -----------------------------------------------------------------------------

brew "rbenv"
brew "ruby-build"

brew "python"
brew "jq"

# -----------------------------------------------------------------------------
# misc.
# -----------------------------------------------------------------------------

brew "binutils"
brew "groff"
brew "stow"
